---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.SetBlue(System.UInt32)
source: html/25ae3fd4-3b8d-6937-6add-bceca9396cc5.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.SetBlue Method

set blue

## Syntax (C#)
```csharp
public void SetBlue(
	uint blue
)
```

## Parameters
- **blue** (`System.UInt32`) - blue

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is not valid. The valid range is 0 to 255.